fact_d = {"temp": ['🌡', '℃'],
          "condition": '',
          "wind_speed": '📈',
          "wind_dir": '🧭',
          "pressure_mm": '💥',
          "humidity": '💦'}

condition_d = {"clear": ["ясно", '☀'],
               "partly-cloudy": ["малооблачно", '🌤'],
               "cloudy": ["облачно с прояснениями", '⛅'],
               "overcast": ["пасмурно", '🌫️'],
               "partly-cloudy-and-light-rain": ["небольшой дождь", '🌦'],
               "cloudy-and-light-rain": ["небольшой дождь", '🌦'],
               "light-rain": ["небольшой дождь", '🌦'],
               "overcast-and-light-rain": ["небольшой дождь", '🌦'],
               "partly-cloudy-and-rain": ["дождь", '🌧'],
               "overcast-and-rain": ["сильный дождь", '⛆'],
               "overcast-thunderstorms-with-rain": ["сильный дождь, гроза", '⛈'],
               "cloudy-and-rain": ["дождь", '☔'],
               "overcast-and-wet-snow": ["дождь со снегом", '🌨'],
               "partly-cloudy-and-snow": ["снег", '❄'],
               "cloudy-and-snow": ["снег", '❄'],
               "partly-cloudy-and-light-snow": ["небольшой снег", '❅'],
               "cloudy-and-light-snow": ["небольшой снег", '❅'],
               "overcast-and-light-snow": ["небольшой снег", '❅'],
               "overcast-and-snow": ["снегопад", '☃'],
               "snow": ["снег", '❄']}

parts_d = {'morning': "утро", 'day': "день",
           'evening': "вечер", 'night': "ночь"}

wind_d = {'nw': ["северо-западное", "↖"],
          "n": ["северное", "⬆"],
          "ne": ["северо-восточное", "↗"],
          "e": ["восточное", "➡"],
          "se": ["юго-восточное", "↘"],
          "s": ["южное", "⬇"],
          "sw": ["юго-западное", "↙"],
          "w": ["западное", "⬅"],
          "с": ["штиль", "⏹️"]}

clock_d = {0: '🕛', 12: '🕛',
           1: '🕐', 13: '🕐',
           2: '🕑', 14: '🕑',
           3: '🕒', 15: '🕒',
           4: '🕓', 16: '🕑',
           5: '🕔', 17: '🕔',
           6: '🕔', 18: '🕔',
           7: '🕖', 19: '🕖',
           8: '🕗', 20: '🕑',
           9: '🕘', 21: '🕘',
           10: '🕙', 22: '🕙',
           11: '🕚', 23: '🕚'}

daytime_d = {"d": ['день','☀ '],
             "n": ['ночь', '🌙']}

sun_d = {"sunrise": '🌅',
         "sunset": '🌇'}

time_d = {"date": '🗓',
          "tzinfo": '🕰',
          "daytime": '',
          "polar": '💫',
          "season": ''}

season_d = {"summer": ['🍃', 'лето'],
            "autumn" : ['🍂', 'осень'],
            "spring": ['🌾', 'весна'],
            "winter": ['❄', 'зима']}

moon_d = {"moon-code-8": ['🌑', 'новолуние'],
          "moon-code-4": ['🌗', 'последняя четверть'],
          "moon-code-0": ['🌕', 'полнолуние'],
          "moon-code-1": ['🌖', 'убывающая Луна'],
          "moon-code-2": ['🌖', 'убывающая Луна'],
          "moon-code-3": ['🌖', 'убывающая Луна'],
          "moon-code-5": ['🌖', 'убывающая Луна'],
          "moon-code-6": ['🌖', 'убывающая Луна'],
          "moon-code-7": ['🌖', 'убывающая Луна'],
          "moon-code-12": ['🌓', 'первая четверть'],
          "moon-code-9": ['🌔', 'растущая Луна'],
          "moon-code-10": ['🌔', 'растущая Луна'],
          "moon-code-11": ['🌔', 'растущая Луна'],
          "moon-code-13": ['🌔', 'растущая Луна'],
          "moon-code-14": ['🌔', 'растущая Луна'],
          "moon-code-15": ['🌔', 'растущая Луна']
          }

choose_l = ["🔵", "🔴", "⬤"]